experiments/results/logs/trace_replay-hybrid-004/wrk2.txt
Running 30m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 4038.430ms, rate sampling interval: 12877ms
  Thread calibration: mean lat.: 3959.749ms, rate sampling interval: 12763ms
  Thread calibration: mean lat.: 4029.656ms, rate sampling interval: 12828ms
  Thread calibration: mean lat.: 3471.148ms, rate sampling interval: 10280ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.21m     5.51m   18.52m    53.33%
    Req/Sec     9.36      5.61    69.00     97.13%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.38m 
 75.000%   14.42m 
 90.000%   16.72m 
 99.000%   18.07m 
 99.900%   18.33m 
 99.990%   18.47m 
 99.999%   18.52m 
100.000%   18.54m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6143.999     0.000000            2         1.00
   89980.927     0.100000         7080         1.11
  189661.183     0.200000        14152         1.25
  294125.567     0.300000        21231         1.43
  446693.375     0.400000        28316         1.67
  562561.023     0.500000        35379         2.00
  619184.127     0.550000        38915         2.22
  668467.199     0.600000        42467         2.50
  720895.999     0.650000        46009         2.86
  774897.663     0.700000        49538         3.33
  865075.199     0.750000        53074         4.00
  892862.463     0.775000        54866         4.44
  914358.271     0.800000        56615         5.00
  937426.943     0.825000        58397         5.71
  962068.479     0.850000        60166         6.67
  982515.711     0.875000        61915         8.00
  993001.471     0.887500        62800         8.89
 1003487.231     0.900000        63677        10.00
 1014497.279     0.912500        64584        11.43
 1024983.039     0.925000        65476        13.33
 1034944.511     0.937500        66378        16.00
 1039663.103     0.943750        66804        17.78
 1044905.983     0.950000        67265        20.00
 1049624.575     0.956250        67662        22.86
 1055391.743     0.962500        68117        26.67
 1061158.911     0.968750        68541        32.00
 1064304.639     0.971875        68774        35.56
 1067450.367     0.975000        68993        40.00
 1070596.095     0.978125        69210        45.71
 1074790.399     0.981250        69488        53.33
 1077936.127     0.984375        69693        64.00
 1078984.703     0.985938        69769        71.11
 1081081.855     0.987500        69908        80.00
 1083179.007     0.989062        70034        91.43
 1084227.583     0.990625        70093       106.67
 1086324.735     0.992188        70212       128.00
 1087373.311     0.992969        70271       142.22
 1088421.887     0.993750        70321       160.00
 1089470.463     0.994531        70370       182.86
 1090519.039     0.995313        70423       213.33
 1092616.191     0.996094        70507       256.00
 1092616.191     0.996484        70507       284.44
 1093664.767     0.996875        70545       320.00
 1094713.343     0.997266        70580       365.71
 1095761.919     0.997656        70604       426.67
 1096810.495     0.998047        70626       512.00
 1096810.495     0.998242        70626       568.89
 1097859.071     0.998437        70650       640.00
 1098907.647     0.998633        70674       731.43
 1098907.647     0.998828        70674       853.33
 1099956.223     0.999023        70690      1024.00
 1099956.223     0.999121        70690      1137.78
 1101004.799     0.999219        70702      1280.00
 1101004.799     0.999316        70702      1462.86
 1102053.375     0.999414        70710      1706.67
 1103101.951     0.999512        70717      2048.00
 1104150.527     0.999561        70725      2275.56
 1104150.527     0.999609        70725      2560.00
 1105199.103     0.999658        70734      2925.71
 1105199.103     0.999707        70734      3413.33
 1105199.103     0.999756        70734      4096.00
 1106247.679     0.999780        70740      4551.11
 1106247.679     0.999805        70740      5120.00
 1106247.679     0.999829        70740      5851.43
 1106247.679     0.999854        70740      6826.67
 1108344.831     0.999878        70743      8192.00
 1108344.831     0.999890        70743      9102.22
 1109393.407     0.999902        70746     10240.00
 1109393.407     0.999915        70746     11702.86
 1109393.407     0.999927        70746     13653.33
 1109393.407     0.999939        70746     16384.00
 1110441.983     0.999945        70747     18204.44
 1110441.983     0.999951        70747     20480.00
 1110441.983     0.999957        70747     23405.71
 1111490.559     0.999963        70749     27306.67
 1111490.559     0.999969        70749     32768.00
 1111490.559     0.999973        70749     36408.89
 1111490.559     0.999976        70749     40960.00
 1111490.559     0.999979        70749     46811.43
 1111490.559     0.999982        70749     54613.33
 1111490.559     0.999985        70749     65536.00
 1112539.135     0.999986        70750     72817.78
 1112539.135     1.000000        70750          inf
#[Mean    =   552640.392, StdDeviation   =   330633.634]
#[Max     =  1111490.560, Total count    =        70750]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71116 requests in 30.01m, 703.91MB read
  Socket errors: connect 0, read 0, write 0, timeout 23461
  Non-2xx or 3xx responses: 4915
Requests/sec:     39.50
Transfer/sec:    400.37KB